const articles = {
    namespaced: true,

    state: {
        articles: [
            {
                id: 1,
                name: ' آلومینیم در نما',
                subTitle:' هر آنچه باید درباره آلومینیم در نمای ساختمان بدانیم',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/Aluminum1.png',
                authorImage: '../src/assets/img/boy.jpg',
                author: 'رضا عباسی',
                time:'09:22',
                readingTime:'29',
                tags:['ابزار آلات','کالای ساختمان','صنعتی'],
                hot:true,
                date:'7 آذر 1401'
            },
            {
                id: 2,
                name: ' لاستیک چیست؟ pvc ',
                subTitle:' در نمای ساختمان / لاستیک پی وی سی / کاربرد لاستیک ',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/article2.png',
                authorImage: '../src/assets/img/boy2.jpg',
                author: 'احمد رضایی',
                time:'09:22',
                readingTime:'29',
                tags:['کالای ساختمان','صنعتی'],
                hot:true,
                date:'7 آبان 1401'
            },
            {
                id: 3,
                name: ' آشنایی با انواع انکربولت و انواع آن ',
                subTitle:' هر آنچه باید درباره انکربولت بدانیم ',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/article3.png',
                authorImage: '../src/assets/img/boy3.jpg',
                author: 'مهدی رمضانی',
                time:'09:22',
                readingTime:'29',
                tags:['ابزار آلات','کالای ساختمان','صنعتی'],
                hot:true,
                date:'7 دی 1401'
            },
            {
                id: 4,
                name: ' آلومینیم در نما',
                subTitle:' هر آنچه باید درباره آلومینیم در نمای ساختمان بدانیم',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/Aluminum1.png',
                authorImage: '../src/assets/img/girl.jpg',
                author: 'مینا غفاری',
                time:'09:22',
                readingTime:'29',
                tags:['کالای ساختمان','صنعتی'],
                hot:true,
                date:'7 بهمن 1401'
            },
            {
                id: 5,
                name: ' آلومینیم در نما',
                subTitle:' هر آنچه باید درباره آلومینیم در نمای ساختمان بدانیم',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/Aluminum1.png',
                authorImage: '../src/assets/img/girl2.jpg',
                author: 'سمیه حمیدی',
                time:'09:22',
                readingTime:'29',
                tags:['ابزار آلات','کالای ساختمان','صنعتی'],
                hot:true,
                date:'7 اسفند 1401'
            },
            {
                id: 6,
                name: ' آشنایی با انواع انکربولت و انواع آن ',
                subTitle:' هر آنچه باید درباره انکربولت بدانیم ',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/article3.png',
                authorImage: '../src/assets/img/boy3.jpg',
                author: 'مهدی رمضانی',
                time:'09:22',
                readingTime:'29',
                tags:['کالای ساختمان','صنعتی'],
                hot:true,
                date:'7 دی 1401'
            },
            {
                id: 7,
                name: ' آلومینیم در نما',
                subTitle:' هر آنچه باید درباره آلومینیم در نمای ساختمان بدانیم',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/Aluminum1.png',
                authorImage: '../src/assets/img/girl.jpg',
                author: 'مینا غفاری',
                time:'09:22',
                readingTime:'29',
                tags:['ابزار آلات','کالای ساختمان','صنعتی'],
                hot:true,
                date:'7 بهمن 1401'
            },
            {
                id: 8,
                name: ' آلومینیم در نما',
                subTitle:' هر آنچه باید درباره آلومینیم در نمای ساختمان بدانیم',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
                image: '../src/assets/img/Aluminum1.png',
                authorImage: '../src/assets/img/girl2.jpg',
                author: 'سمیه حمیدی',
                time:'09:22',
                readingTime:'29',
                tags:['ابزار آلات'],
                hot:true,
                date:'7 اسفند 1401'
            }
        ]
    },
    getters:{
        allArticles(state){
             return state.articles
        },
        hotArticles(state){
            return state.articles.filter(article=>article.hot===true)
       },
       newArticles(state){
        return state.articles.slice(-4);
   }
    }
}
export default articles;